Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/abstraction-rtos/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
/***********************************************************************************************//**
 * \file cyabs_rtos_rtxv5.c
 *
 * \brief
 * Implementation for CMSIS RTOS v2 abstraction
 *
 ***************************************************************************************************
 * \copyright
 * Copyright 2018-2020 Cypress Semiconductor Corporation
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 **************************************************************************************************/

#include <stdlib.h>
#include <cy_utils.h>
#include <cyabs_rtos.h>

#if defined(__cplusplus)
extern "C" {
#endif


/******************************************************
*                 Error Converter
******************************************************/

// Last received error status
static cy_rtos_error_t dbgErr;


//--------------------------------------------------------------------------------------------------
// cy_rtos_last_error
//--------------------------------------------------------------------------------------------------
cy_rtos_error_t cy_rtos_last_error()
{
    return dbgErr;
}


//--------------------------------------------------------------------------------------------------
// error_converter
//
// Converts internal error type to external error type
//--------------------------------------------------------------------------------------------------
static cy_rslt_t error_converter(cy_rtos_error_t internalError)
{
    cy_rslt_t value;

    switch (internalError)
    {
        case osOK:
            value = CY_RSLT_SUCCESS;
            break;

        case osErrorTimeout:
            value = CY_RTOS_TIMEOUT;
            break;

        case osErrorParameter:
            value = CY_RTOS_BAD_PARAM;
            break;

        case osErrorNoMemory:
            value = CY_RTOS_NO_MEMORY;
            break;

        case osError:
        case osErrorResource:
        case osErrorISR:
        default:
            value = CY_RTOS_GENERAL_ERROR;
            break;
    }

    // Update the last known error status
    dbgErr = internalError;
    return value;
}


/******************************************************
*                 Threads
******************************************************/

cy_rslt_t cy_rtos_create_thread(cy_thread_t* thread, cy_thread_entry_fn_t entry_function,
                                const char* name, void* stack, uint32_t stack_size,
                                cy_thread_priority_t priority, cy_thread_arg_t arg)
{
    cy_rslt_t      status = CY_RSLT_SUCCESS;
    osThreadAttr_t attr;

    if ((thread == NULL) || (stack_size < CY_RTOS_MIN_STACK_SIZE))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else if ((stack != NULL) && (0 != (((uint32_t)stack) & CY_RTOS_ALIGNMENT_MASK)))
    {
        status = CY_RTOS_ALIGNMENT_ERROR;
    }
    else
    {
        attr.name       = name;
        attr.attr_bits  = osThreadJoinable;
        attr.cb_size    = osRtxThreadCbSize;
        attr.stack_size = stack_size;
        attr.priority   = (osPriority_t)priority;
        attr.tz_module  = 0;
        attr.reserved   = 0;

        // Allocate stack if NULL was passed
        if ((uint32_t*)stack == NULL)
        {
            // Note: 1 malloc so that it can be freed with 1 call when terminating
            uint32_t cb_mem_pad = (~osRtxThreadCbSize + 1) & CY_RTOS_ALIGNMENT_MASK;
            attr.cb_mem = malloc(osRtxThreadCbSize + cb_mem_pad + stack_size);
            if (attr.cb_mem != NULL)
            {
                attr.stack_mem =
                    (uint32_t*)((uint32_t)attr.cb_mem + osRtxThreadCbSize + cb_mem_pad);
            }
        }
        else
        {
            attr.cb_mem    = malloc(osRtxThreadCbSize);
            attr.stack_mem = stack;
        }

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            CY_ASSERT(((uint32_t)attr.stack_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *thread = osThreadNew((osThreadFunc_t)entry_function, arg, &attr);
            CY_ASSERT((*thread == attr.cb_mem) || (*thread == NULL));
            status = (*thread == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_exit_thread
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_exit_thread()
{
    // This does not have a return statement because the osThreadExit() function * does not return
    // so the return statement would be unreachable and causes a * warning for IAR compiler.
    osThreadExit();
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_terminate_thread
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_terminate_thread(cy_thread_t* thread)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (thread == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osThreadTerminate(*thread);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_is_thread_running
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_is_thread_running(cy_thread_t* thread, bool* running)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((thread == NULL) || (running == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *running = (osThreadGetState(*thread) == osThreadRunning) ? true : false;
    }

