Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/abstraction-rtos/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_get_thread_state
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_get_thread_state(cy_thread_t* thread, cy_thread_state_t* state)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((thread == NULL) || (state == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        switch (osThreadGetState(*thread))
        {
            case osThreadInactive:
                *state = CY_THREAD_STATE_INACTIVE;
                break;

            case osThreadReady:
                *state = CY_THREAD_STATE_READY;
                break;

            case osThreadRunning:
                *state = CY_THREAD_STATE_RUNNING;
                break;

            case osThreadBlocked:
                *state = CY_THREAD_STATE_BLOCKED;
                break;

            case osThreadTerminated:
                *state = CY_THREAD_STATE_TERMINATED;
                break;

            case osThreadError:
            case osThreadReserved:
            default:
                *state = CY_THREAD_STATE_UNKNOWN;
                break;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_join_thread
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_join_thread(cy_thread_t* thread)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (thread == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osThreadJoin(*thread);
        status         = error_converter(statusInternal);

        if (status == CY_RSLT_SUCCESS)
        {
            free(*thread);
            *thread = NULL;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_get_thread_handle
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_get_thread_handle(cy_thread_t* thread)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if (thread == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *thread = osThreadGetId();
    }

    return status;
}


/******************************************************
*                 Mutexes
******************************************************/

cy_rslt_t cy_rtos_init_mutex2(cy_mutex_t* mutex, bool recursive)
{
    cy_rslt_t     status;
    osMutexAttr_t attr;

    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        attr.name      = NULL;
        attr.attr_bits = osMutexPrioInherit;
        if (recursive)
        {
            attr.attr_bits |= osMutexRecursive;
        }
        attr.cb_mem  = malloc(osRtxMutexCbSize);
        attr.cb_size = osRtxMutexCbSize;

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *mutex = osMutexNew(&attr);
            CY_ASSERT((*mutex == attr.cb_mem) || (*mutex == NULL));
            status = (*mutex == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_get_mutex
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_get_mutex(cy_mutex_t* mutex, cy_time_t timeout_ms)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMutexAcquire(*mutex, timeout_ms);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_set_mutex
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_set_mutex(cy_mutex_t* mutex)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMutexRelease(*mutex);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_deinit_mutex
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_deinit_mutex(cy_mutex_t* mutex)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (mutex == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMutexDelete(*mutex);
        status         = error_converter(statusInternal);

        if (status == CY_RSLT_SUCCESS)
        {
            free(*mutex);
            *mutex = NULL;
        }
    }

    return status;
}


/******************************************************
*                 Semaphores
******************************************************/

cy_rslt_t cy_rtos_init_semaphore(cy_semaphore_t* semaphore, uint32_t maxcount, uint32_t initcount)
{
    cy_rslt_t         status;
    osSemaphoreAttr_t attr;

    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        attr.name      = NULL;
        attr.attr_bits = 0U;
        attr.cb_mem    = malloc(osRtxSemaphoreCbSize);
        attr.cb_size   = osRtxSemaphoreCbSize;

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *semaphore = osSemaphoreNew(maxcount, initcount, &attr);
            CY_ASSERT((*semaphore == attr.cb_mem) || (*semaphore == NULL));
            status = (*semaphore == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

