Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/abstraction-rtos/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_get_semaphore
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_get_semaphore(cy_semaphore_t* semaphore, cy_time_t timeout_ms, bool in_isr)
{
    cy_rslt_t       status = CY_RSLT_SUCCESS;
    cy_rtos_error_t statusInternal;

    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        // Not allowed to be called in ISR if timeout != 0
        if ((!in_isr) || (in_isr && (timeout_ms == 0U)))
        {
            statusInternal = osSemaphoreAcquire(*semaphore, timeout_ms);
        }
        else
        {
            statusInternal = osErrorISR;
        }

        status = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_set_semaphore
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_set_semaphore(cy_semaphore_t* semaphore, bool in_isr)
{
    cy_rslt_t       status = CY_RSLT_SUCCESS;
    cy_rtos_error_t statusInternal;
    (void)in_isr; // Unused parameter in this implementation

    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osSemaphoreRelease(*semaphore);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_get_count_semaphore
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_get_count_semaphore(cy_semaphore_t* semaphore, size_t* count)
{
    cy_rslt_t status;
    if ((semaphore == NULL) || (count == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *count = osSemaphoreGetCount(*semaphore);
        status = CY_RSLT_SUCCESS;
    }
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_deinit_semaphore
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_deinit_semaphore(cy_semaphore_t* semaphore)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (semaphore == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osSemaphoreDelete(*semaphore);
        status         = error_converter(statusInternal);
        if (status == CY_RSLT_SUCCESS)
        {
            free(*semaphore);
            *semaphore = NULL;
        }
    }

    return status;
}


/******************************************************
*                 Events
******************************************************/

#define CY_RTOS_EVENT_ERRORFLAG     0x80000000UL
#define CY_RTOS_EVENT_FLAGS         0x7FFFFFFFUL

//--------------------------------------------------------------------------------------------------
// cy_rtos_init_event
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_init_event(cy_event_t* event)
{
    cy_rslt_t          status;
    osEventFlagsAttr_t attr;

    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        attr.name      = NULL;
        attr.attr_bits = 0U;
        attr.cb_mem    = malloc(osRtxEventFlagsCbSize);
        attr.cb_size   = osRtxEventFlagsCbSize;

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *event = osEventFlagsNew(&attr);
            CY_ASSERT((*event == attr.cb_mem) || (*event == NULL));
            status = (*event == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_setbits_event
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_setbits_event(cy_event_t* event, uint32_t bits, bool in_isr)
{
    cy_rslt_t       status = CY_RSLT_SUCCESS;
    cy_rtos_error_t statusInternal;
    (void)in_isr; // Unused parameter in this implementation

    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = (osStatus_t)osEventFlagsSet(*event, bits);
        if ((statusInternal & CY_RTOS_EVENT_ERRORFLAG) != 0UL)
        {
            status = error_converter(statusInternal);
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_clearbits_event
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_clearbits_event(cy_event_t* event, uint32_t bits, bool in_isr)
{
    cy_rslt_t       status = CY_RSLT_SUCCESS;
    cy_rtos_error_t statusInternal;
    (void)in_isr; // Unused parameter in this implementation

    if (event == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = (osStatus_t)osEventFlagsClear(*event, bits);
        if ((statusInternal & CY_RTOS_EVENT_ERRORFLAG) != 0UL)
        {
            status = error_converter(statusInternal);
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_getbits_event
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_getbits_event(cy_event_t* event, uint32_t* bits)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((event == NULL) || (bits == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *bits = osEventFlagsGet(*event);
    }

