Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/abstraction-rtos/source/COMPONENT_RTX/cyabs_rtos_rtxv5.c
    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_reset_queue
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_reset_queue(cy_queue_t* queue)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (queue == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMessageQueueReset(*queue);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_deinit_queue
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_deinit_queue(cy_queue_t* queue)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (queue == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osMessageQueueDelete(*queue);
        status         = error_converter(statusInternal);

        if (status == CY_RSLT_SUCCESS)
        {
            free(*queue);
            *queue = NULL;
        }
    }

    return status;
}


/******************************************************
*                 Timers
******************************************************/

cy_rslt_t cy_rtos_init_timer(cy_timer_t* timer, cy_timer_trigger_type_t type,
                             cy_timer_callback_t fun, cy_timer_callback_arg_t arg)
{
    cy_rslt_t     status;
    osTimerAttr_t attr;

    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        attr.name      = NULL;
        attr.attr_bits = 0U;
        attr.cb_mem    = malloc(osRtxTimerCbSize);
        attr.cb_size   = osRtxTimerCbSize;

        if (attr.cb_mem == NULL)
        {
            status = CY_RTOS_NO_MEMORY;
        }
        else
        {
            osTimerType_t osTriggerType = (CY_TIMER_TYPE_PERIODIC == type)
                ? osTimerPeriodic
                : osTimerOnce;

            CY_ASSERT(((uint32_t)attr.cb_mem & CY_RTOS_ALIGNMENT_MASK) == 0UL);
            *timer = osTimerNew((osTimerFunc_t)fun, osTriggerType, (void*)arg, &attr);
            CY_ASSERT((*timer == attr.cb_mem) || (*timer == NULL));
            status = (*timer == NULL) ? CY_RTOS_GENERAL_ERROR : CY_RSLT_SUCCESS;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_start_timer
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_start_timer(cy_timer_t* timer, cy_time_t num_ms)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        // Get Number of ticks per second
        uint32_t tick_freq = osKernelGetTickFreq();

        // Convert ticks count to time in milliseconds
        if (tick_freq != 0)
        {
            uint32_t ticks = ((num_ms * tick_freq) / 1000);
            statusInternal = osTimerStart(*timer, ticks);
            status         = error_converter(statusInternal);
        }
        else
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_stop_timer
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_stop_timer(cy_timer_t* timer)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osTimerStop(*timer);
        status         = error_converter(statusInternal);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_is_running_timer
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_is_running_timer(cy_timer_t* timer, bool* state)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;

    if ((timer == NULL) || (state == NULL))
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        *state = osTimerIsRunning(*timer);
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_deinit_timer
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_deinit_timer(cy_timer_t* timer)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    if (timer == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        statusInternal = osTimerDelete(*timer);
        status         = error_converter(statusInternal);

        if (status == CY_RSLT_SUCCESS)
        {
            free(*timer);
            *timer = NULL;
        }
    }

    return status;
}


/******************************************************
*                 Time
******************************************************/

cy_rslt_t cy_rtos_get_time(cy_time_t* tval)
{
    cy_rslt_t status = CY_RSLT_SUCCESS;
    uint32_t  tick_freq;

    if (tval == NULL)
    {
        status = CY_RTOS_BAD_PARAM;
    }
    else
    {
        // Get Number of ticks per second
        tick_freq = osKernelGetTickFreq();

        // Convert ticks count to time in milliseconds
        if (tick_freq != 0)
        {
            *tval = (cy_time_t)((osKernelGetTickCount() * 1000LL) / tick_freq);
        }
        else
        {
            status = CY_RTOS_GENERAL_ERROR;
        }
    }

    return status;
}


//--------------------------------------------------------------------------------------------------
// cy_rtos_delay_milliseconds
//--------------------------------------------------------------------------------------------------
cy_rslt_t cy_rtos_delay_milliseconds(cy_time_t num_ms)
{
    cy_rslt_t       status;
    cy_rtos_error_t statusInternal;

    statusInternal = osDelay(num_ms);
    status         = error_converter(statusInternal);

    return status;
}


#if defined(__cplusplus)
}
#endif
